{
    "transformedSummaries": [
        {
            "title": "Viv Richards Backs India for T20 World Cup Glory",
            "summary": "West Indies cricket icon Vivian Richards presented Suryakumar Yadav with the 'Fielder of the Match' award after India's dominant 50-run victory over Bangladesh in their ICC T20 World Cup Super Eights encounter. Richards, renowned for his fearless style, expressed admiration for the Indian team's prowess and hinted at his support for them in the tournament. He specifically praised their relentless fielding effort, highlighting Suryakumar, Axar Patel, and Rohit Sharma for their contributions. Richards' endorsement extended to Rishabh Pant, acknowledging the wicketkeeper-batter's resilience following a severe car accident. The legendary cricketer concluded by stating that if the West Indies fall short of the title, he would be wholeheartedly backing India to end their 11-year ICC trophy drought.",
            "source": {
                "id": null,
                "name": "NDTV News"
            },
            "url": "https://sports.ndtv.com/t20-world-cup-2024/virat-kohli-rohit-sharma-on-their-feet-as-true-legend-arrives-for-best-fielder-medal-watch-5950925",
            "urlToImage": "https://c.ndtvimg.com/2024-06/m45hmvlo_kohli-and-rohit_625x300_23_June_24.jpg?im=FitAndFill,algorithm=dnn,width=1200,height=675",
            "publishedAt": "2024-06-23T07:54:48Z"
        },
        {
            "title": "Virat Kohli's Gully Cricket Antics Light Up T20 World Cup Clash",
            "summary": "Virat Kohli provided a moment of levity during India's T20 World Cup clash against Bangladesh, showcasing his gully cricket skills to the amusement of fans and commentators. After Rishad Hossain smashed a six that went under the advertising hoardings, Kohli instinctively went on his knees and retrieved the ball, evoking memories of street cricket where such maneuvers are commonplace. While Kohli's batting form has been a subject of scrutiny, he managed a brisk 37 runs in the match. However, it was Hardik Pandya who stole the show with a blistering half-century and a crucial wicket, earning him the Player of the Match award as India cruised to victory.",
            "source": {
                "id": null,
                "name": "NDTV News"
            },
            "url": "https://sports.ndtv.com/t20-world-cup-2024/virat-kohlis-gully-cricket-moment-to-retrieve-ball-has-social-media-in-splits-watch-5950495",
            "urlToImage": "https://c.ndtvimg.com/2024-06/m059nng8_virat-kohli-twitter_625x300_23_June_24.jpg?im=FitAndFill,algorithm=dnn,width=1200,height=675",
            "publishedAt": "2024-06-23T06:58:02Z"
        },
        {
            "title": "Sunil Gavaskar's Critique of Virat Kohli Ignites Social Media Firestorm",
            "summary": "Former Indian cricketer Sunil Gavaskar's on-air commentary during the India-Bangladesh T20 World Cup match has ignited a social media storm. Gavaskar expressed disappointment at Virat Kohli's dismissal, suggesting the star batsman should have opted for an inside-out shot instead of attempting a slog that led to his downfall. While Gavaskar's remarks appeared to be constructive criticism, they sparked a flurry of reactions online, with some fans defending Kohli and others siding with the legendary commentator. The incident has reignited the debate about Kohli's recent form and his vulnerability to certain types of dismissals.",
            "source": {
                "id": null,
                "name": "Zoom"
            },
            "url": "https://www.timesnownews.com/sports/cricket/what-was-he-looking-to-do-gavaskars-remark-on-kohlis-dismissal-sparks-social-media-outrage-article-111195691",
            "urlToImage": "https://static.tnn.in/thumb/msid-111195691,width-1280,height-720,resizemode-75/111195691.jpg",
            "publishedAt": "2024-06-22T19:09:23Z"
        },
        {
            "title": "Virat Kohli's Frustration Erupts After Rishabh Pant's Dismissal",
            "summary": "Virat Kohli's frustration was palpable during India's T20 World Cup Super 8 clash against Bangladesh following Rishabh Pant's dismissal. Pant, looking set for a big score after a quickfire 34, fell victim to a familiar foe—the reverse sweep—much to the dismay of Kohli, whose animated reaction was captured on camera and quickly circulated on social media. This incident follows a similar pattern in Pant's recent dismissals, raising concerns about his shot selection. Despite this setback, India posted a commanding total of 196, thanks to Kohli's own contribution of 37 runs and a blistering half-century from Hardik Pandya.",
            "source": {
                "id": null,
                "name": "Zoom"
            },
            "url": "https://www.timesnownews.com/sports/cricket/virat-kohlis-frustrated-reaction-to-rishabh-pants-dismissal-goes-viral-gives-long-pep-talk-watch-article-111195066",
            "urlToImage": "https://static.tnn.in/thumb/msid-111195066,width-1280,height-720,resizemode-75/111195066.jpg",
            "publishedAt": "2024-06-22T17:37:25Z"
        },
        {
            "title": "Kohli's Lean Patch a Blessing in Disguise for India, Says Batting Coach",
            "summary": "India's batting coach, Vikram Rathour, has offered a unique perspective on Virat Kohli's ongoing struggles in the T20 World Cup. Rathour believes that while Kohli's lack of runs is not ideal, it has presented an opportunity for other players to step up and showcase their abilities. He highlighted the impressive performances of Rishabh Pant and Suryakumar Yadav in recent matches as evidence of the team's depth. Despite facing criticism for his form, Kohli has remained a vital cog in the Indian lineup, contributing valuable runs in crucial partnerships. Rathour remains optimistic that Kohli will regain his touch and continue to play a significant role in India's World Cup campaign.",
            "source": {
                "id": null,
                "name": "NDTV News"
            },
            "url": "https://sports.ndtv.com/t20-world-cup-2024/im-not-happy-india-coachs-blockbuster-take-on-virat-kohlis-lean-t20-world-cup-run-5941212",
            "urlToImage": "https://c.ndtvimg.com/2024-06/e28s1qa_virat-kohli-afp_625x300_13_June_24.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675",
            "publishedAt": "2024-06-22T01:53:30Z"
        }
    ]
}